# Дана последовательность чисел. 
# Получить список неповторяющихся элементов исходной последовательности
# Пример: [1, 2, 3, 5, 1, 5, 3, 10] => [1, 2, 3, 5, 10]
list=[8, 10, 4, 7, 8, 3, 10, 5, 2, 8]

def get_unic_value(list):
    return [i for i in set(list)]

print(list)
print(get_unic_value(list))